# Напишите программу, которая принимает на вход цифру, обозначающую день недели, и
# проверяет, является ли этот день выходным.
a = int(input('введите номер дня недели, неделя начинается с понедельника '))
if a == 6:
    print(f'{a} -> выходной')
elif a == 7:
    print(f'{a} -> выходной')
elif 1 <= a <= 5:
    print(f'{a} -> ,будний день')
else:
    print('нет такого дня недели!')